In [1]:
import pandas as pd

In [3]:
data = pd.read_csv('bigmac.csv')

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 652 entries, 0 to 651
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 652 non-null    object
 1   Country              652 non-null    object
 2   Price in US Dollars  652 non-null    float64
dtypes: float64(1), object(2)
memory usage: 15.4+ KB

In [5]:
data.describe()

       Price in US Dollars
count           652.000000
mean              3.742853
std               1.288534
min               0.660000
25%               2.730000
50%               3.650000
75%               4.540000
max               9.080000

In [6]:
data.head()

     Date    Country  Price in US Dollars
0  1/2016  Argentina                 2.39
1  1/2016  Australia                 3.74
2  1/2016     Brazil                 3.35
3  1/2016    Britain                 4.22
4  1/2016     Canada                 4.14

In [7]:
data.nunique()

Date                    12
Country                 58
Price in US Dollars    330
dtype: int64

In [ ]:
data.set_index(keys = ['Date', 'Country'], inplace=True)

In [9]:
data.head()

                  Price in US Dollars
Date   Country
1/2016 Argentina                 2.39
       Australia                 3.74
       Brazil                    3.35
       Britain                   4.22
       Canada                    4.14

In [10]:
data.index

MultiIndex([('1/2016',      'Argentina'),
            ('1/2016',      'Australia'),
            ('1/2016',         'Brazil'),
            ('1/2016',        'Britain'),
            ('1/2016',         'Canada'),
            ('1/2016',          'Chile'),
            ('1/2016',          'China'),
            ('1/2016',       'Colombia'),
            ('1/2016',     'Costa Rica'),
            ('1/2016', 'Czech Republic'),
            ...
            ('1/2010',      'Sri Lanka'),
            ('1/2010',         'Sweden'),
            ('1/2010',    'Switzerland'),
            ('1/2010',         'Taiwan'),
            ('1/2010',       'Thailand'),
            ('1/2010',         'Turkey'),
            ('1/2010',            'UAE'),
            ('1/2010',        'Ukraine'),
            ('1/2010',  'United States'),
            ('1/2010',        'Uruguay')],
           names=['Date', 'Country'], length=652)

In [13]:
data = {'Ime': ['Ajla', 'Iman', 'Haris', 'Ajdin', 'Mia', 'Sara'],
        'DobnaSkupina': ['3-5', '6-8', '3-5', '6-8', '3-5', '6-8'],
        'Igračke': [10, 5, 8, 12, 15, 7]}
df = pd.DataFrame(data)

df.head()

     Ime DobnaSkupina  Igračke
0   Ajla          3-5       10
1   Iman          6-8        5
2  Haris          3-5        8
3  Ajdin          6-8       12
4    Mia          3-5       15

In [15]:
grupirano_po_dobnoj_skupini = df.groupby('DobnaSkupina')['Igračke'].sum()
grupirano_po_dobnoj_skupini

DobnaSkupina
3-5    33
6-8    24
Name: Igračke, dtype: int64